##列表
#定义
a = [1, 2, 3, 4, 5]
b = ["Hello", "world"]
c = [1, "Hello", 2.0]
d = [1, 2, [3, 4]]
e = []
f = list()

#查
a = [1, 2, 3, 4, 5]
a # [1, 2, 3, 4, 5]
a[0] # 1
a[1:3] # [2, 3]
a[-1] # 5
a[-3:] # [3, 4, 5]
a[::2] # [1, 3, 5]
a[::-1] # [5, 4, 3, 2, 1]
a[::] # [1, 2, 3, 4, 5]

#增
a = [1, 2, 3]
a.append(4) # [1, 2, 3, 4]
a.insert(1, 5) # [1, 5, 2, 3, 4]
a.extend([6, 7]) # [1, 5, 2, 3, 4, 6, 7]
a + [8, 9] # [1, 5, 2, 3, 4, 6, 7, 8, 9]
a * 2 # [1, 5, 2, 3, 4, 6, 7, 1, 5, 2, 3, 4, 6, 7]

#删
a = [1, 2, 3, 4, 5]
a.pop() # [1, 2, 3, 4]
a.pop(1) # [1, 3, 4]
a.remove(3) # [1, 4]
del a[0] # [4]
a.clear() # []

#改
a = [1, 2, 3]
a[0] = 4 # [4, 2, 3]
a[1:3] = [5, 6] # [4, 5, 6]

##元组
#定义
a = (1, 2, 3)
b = ("some",) #单元素这样定义
c = ()
d = tuple()

#应用
a = 1
b = 2
a, b = b, a #2, 1

##集合
#定义
a = {1, 2, 3, 4, 5}
b = {1, 1, 2, 3, 3, 4, 5} # {1, 2, 3, 4, 5}
c = set() #空的集合

#部分操作
a = {1, 2, 3, 4, 5}
1 in a # True
6 not in a # True
a.add(6) # {1, 2, 3, 4, 5, 6}
a.remove(6) # {1, 2, 3, 4, 5}
a.clear() # {}

#一些集合操作
a = {1, 2, 3, 4, 5}
b = {4, 5, 6, 7, 8}
a | b # {1, 2, 3, 4, 5, 6, 7, 8} 并集
a & b # {4, 5} 交集
a - b # {1, 2, 3} 差集
a ^ b # {1, 2, 3, 6, 7, 8} 对称差

##字典
#定义
a = {"name": "张三", "age": 18}
b = dict()
c = {}

#一些字典操作
a["from"] = "Hnu" # {"name": "张三", "age": 18, "from": "Hnu"}
a["name"] = "CFIT" # {"name": "CFIT", "age": 18, "from": "Hnu"}
a["id"] # 错误，找不到键
a.get("age") # 18
a.get("id") is None # True
a.get("id",1) # 1
a.pop("from") # 输出Hnu,同时该元素被移除
a # {"name": "CFIT", "age": 18}
a.clear() # {}

##生成式

#列表/元组/集合/字典
[i**2 for i in range(1,10)] # [1, 4, 9, 16, 25, 36, 49, 64, 81]
tuple(i**2 for i in range(1,10)) # (1, 4, 9, 16, 25, 36, 49, 64, 81)
{i for i in range(1,10)} # {1, 2, 3, 4, 5, 6, 7, 8, 9}
{a:b**2 for a,b in zip(range(1,10),range(9,0,-1))} # {1: 81, 2: 64, 3: 49, 4: 36, 5: 25, 6: 16, 7: 9, 8: 4, 9: 1}